Examinator/src/Enums/АлфавитАнглийскийСУЗ/АлфавитАнглийскийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АлфавитАнглийскийСУЗ</name>
  <enumValues>
    <name>A</name>
  </enumValues>
  <enumValues>
    <name>B</name>
  </enumValues>
  <enumValues>
    <name>C</name>
  </enumValues>
  <enumValues>
    <name>D</name>
  </enumValues>
  <enumValues>
    <name>E</name>
  </enumValues>
  <enumValues>
    <name>F</name>
  </enumValues>
  <enumValues>
    <name>G</name>
  </enumValues>
  <enumValues>
    <name>H</name>
  </enumValues>
  <enumValues>
    <name>I</name>
  </enumValues>
  <enumValues>
    <name>J</name>
  </enumValues>
  <enumValues>
    <name>K</name>
  </enumValues>
  <enumValues>
    <name>L</name>
  </enumValues>
  <enumValues>
    <name>M</name>
  </enumValues>
  <enumValues>
    <name>N</name>
  </enumValues>
  <enumValues>
    <name>O</name>
  </enumValues>
  <enumValues>
    <name>P</name>
  </enumValues>
  <enumValues>
    <name>Q</name>
  </enumValues>
  <enumValues>
    <name>R</name>
  </enumValues>
  <enumValues>
    <name>S</name>
  </enumValues>
  <enumValues>
    <name>T</name>
  </enumValues>
  <enumValues>
    <name>U</name>
  </enumValues>
  <enumValues>
    <name>V</name>
  </enumValues>
  <enumValues>
    <name>W</name>
  </enumValues>
  <enumValues>
    <name>X</name>
  </enumValues>
  <enumValues>
    <name>Y</name>
  </enumValues>
  <enumValues>
    <name>Z</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/АлфавитРусскийСУ/АлфавитРусскийСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АлфавитРусскийСУ</name>
  <enumValues>
    <name>А</name>
  </enumValues>
  <enumValues>
    <name>Б</name>
  </enumValues>
  <enumValues>
    <name>В</name>
  </enumValues>
  <enumValues>
    <name>Г</name>
  </enumValues>
  <enumValues>
    <name>Д</name>
  </enumValues>
  <enumValues>
    <name>Е</name>
  </enumValues>
  <enumValues>
    <name>Ё</name>
  </enumValues>
  <enumValues>
    <name>Ж</name>
  </enumValues>
  <enumValues>
    <name>З</name>
  </enumValues>
  <enumValues>
    <name>И</name>
  </enumValues>
  <enumValues>
    <name>К</name>
  </enumValues>
  <enumValues>
    <name>Л</name>
  </enumValues>
  <enumValues>
    <name>М</name>
  </enumValues>
  <enumValues>
    <name>Н</name>
  </enumValues>
  <enumValues>
    <name>О</name>
  </enumValues>
  <enumValues>
    <name>П</name>
  </enumValues>
  <enumValues>
    <name>Р</name>
  </enumValues>
  <enumValues>
    <name>С</name>
  </enumValues>
  <enumValues>
    <name>Т</name>
  </enumValues>
  <enumValues>
    <name>У</name>
  </enumValues>
  <enumValues>
    <name>Ф</name>
  </enumValues>
  <enumValues>
    <name>Х</name>
  </enumValues>
  <enumValues>
    <name>Ц</name>
  </enumValues>
  <enumValues>
    <name>Ч</name>
  </enumValues>
  <enumValues>
    <name>Ш</name>
  </enumValues>
  <enumValues>
    <name>Щ</name>
  </enumValues>
  <enumValues>
    <name>Ъ</name>
  </enumValues>
  <enumValues>
    <name>Ы</name>
  </enumValues>
  <enumValues>
    <name>Ь</name>
  </enumValues>
  <enumValues>
    <name>Э</name>
  </enumValues>
  <enumValues>
    <name>Ю</name>
  </enumValues>
  <enumValues>
    <name>Я</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonModules/ОбщегоНазначенияСУ/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ЧИСЛАМИ

// Возвращает случайное число.
//
Функция СлучайноеЧисло(Мин, Макс, НачальноеЧисло = Неопределено) Экспорт
	
	Если НачальноеЧисло = Неопределено Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел();
	Иначе
		ГСЧ = Новый ГенераторСлучайныхЧисел(НачальноеЧисло);
	КонецЕсли;
	
	Возврат ГСЧ.СлучайноеЧисло(Мин, Макс);	

КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// РАБОТА СО СТРОКАМИ

// Определяет, является строка буквой.
//
Функция ЭтоБуква(Буква) Экспорт
	
	Попытка
		ЗначениеПеречисления = Перечисления.АлфавитАнглийскийСУЗ[Буква];
		Возврат Истина;
	Исключение
	КонецПопытки;
	
	Попытка
		ЗначениеПеречисления = Перечисления.АлфавитРусскийСУ[Буква];
		Возврат Истина;
	Исключение
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоЦифра(Цифра) Экспорт
	
	Попытка
		ЗначениеПеречисления = Перечисления.ЦифрыСУ["_" + Цифра];
		Возврат Истина;
	Исключение
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Функция УникальныйИдентификаторИзСтроки(Знач УникальнаяСтрока) Экспорт
	
	МассивГенераторов = Новый Массив(32);
	
	НомерСимвола    = 0;
	НомерГенератора = 0;
	ДлинаСтроки     = СтрДлина(УникальнаяСтрока);
	
	Пока НомерСимвола < ДлинаСтроки Цикл
		
		НомерСимвола = НомерСимвола + 1;
		
		КодСимвола = КодСимвола(НРег(УникальнаяСтрока), НомерСимвола);
		
		МассивГенераторов.Установить(НомерГенератора, Строка(МассивГенераторов[НомерГенератора]) + Строка(КодСимвола)); 
		
		Если НомерГенератора = 31 Тогда
			НомерГенератора = 0;
		Иначе
			НомерГенератора = НомерГенератора + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивГенераторов.Вставить(8, "-");
	МассивГенераторов.Вставить(13, "-");
	МассивГенераторов.Вставить(18, "-");
	МассивГенераторов.Вставить(23, "-");
	
	УникальныйИдентификатор = "";
	
	НомерГенератора = 0;
	
	Для каждого Генератор Из МассивГенераторов Цикл
	
		Если Генератор = "-" Тогда
			
			УникальныйИдентификатор = УникальныйИдентификатор + "-";
			
		Иначе
			
			Попытка
				НачальноеЧислоГенератора = Число(Генератор);
			Исключение
				НачальноеЧислоГенератора = НомерГенератора;
			КонецПопытки;
			
			ГенераторСЧ = Новый ГенераторСлучайныхЧисел(НачальноеЧислоГенератора);
			
			СлучайныйСимвол = ГенераторСЧ.СлучайноеЧисло(0, 15);
			
			Если СлучайныйСимвол = 10 Тогда
				СлучайныйСимвол = "a";	
			КонецЕсли;
			
			Если СлучайныйСимвол = 11 Тогда
				СлучайныйСимвол = "b";	
			КонецЕсли;
			
			Если СлучайныйСимвол = 12 Тогда
				СлучайныйСимвол = "c";	
			КонецЕсли;
			
			Если СлучайныйСимвол = 13 Тогда
				СлучайныйСимвол = "d";	
			КонецЕсли;
			
			Если СлучайныйСимвол = 14 Тогда
				СлучайныйСимвол = "e";	
			КонецЕсли;
			
			Если СлучайныйСимвол = 15 Тогда
				СлучайныйСимвол = "f";	
			КонецЕсли;
			
			УникальныйИдентификатор = УникальныйИдентификатор + СлучайныйСимвол;
			
		КонецЕсли;
		
		НомерГенератора = НомерГенератора + 1;
		
	КонецЦикла;
	
	Возврат УникальныйИдентификатор;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С КОЛЛЕКЦИЯМИ ЗНАЧЕНИЙ

// Перемешивает элементы массива в случайном порядке.
//
Функция ПеремешатьМассив(ВходМассив) Экспорт
	
	ДлиннаМассива = ВходМассив.Количество();
	
	Если ДлиннаМассива = 0 Тогда
		Возврат ВходМассив;
	КонецЕсли;
		
	МаксимальноеЧислоИтераций = СлучайноеЧисло(1000, 5000);	
	ОбщееСлучайноеЧисло1  = СлучайноеЧисло(0, 4294967295);
	ОбщееСлучайноеЧисло2  = СлучайноеЧисло(0, 4294967295, ОбщееСлучайноеЧисло1);
	ОбщееСлучайноеЧисло3  = СлучайноеЧисло(0, 4294967295, ОбщееСлучайноеЧисло2 + ОбщееСлучайноеЧисло1);
	
	ЧислоИтераций = 0;
	ТекущийИндекс = 0;
	СлучайныйИндекс = 0;
	Пока ЧислоИтераций < МаксимальноеЧислоИтераций Цикл
				
		СлучайныйИндекс = СлучайноеЧисло(0, ДлиннаМассива-1, СлучайныйИндекс + МаксимальноеЧислоИтераций + ОбщееСлучайноеЧисло1 + ОбщееСлучайноеЧисло2 + ОбщееСлучайноеЧисло3 + ТекущийИндекс + ДлиннаМассива);

		СлучайноеЗначение = ВходМассив[СлучайныйИндекс];
		ВходМассив[СлучайныйИндекс] = ВходМассив[ТекущийИндекс];
		ВходМассив[ТекущийИндекс] = СлучайноеЗначение;		
		
		ЧислоИтераций = ЧислоИтераций + 1;
		ТекущийИндекс = ТекущийИндекс + 1;
		Если ТекущийИндекс > ДлиннаМассива - 1 Тогда
			ТекущийИндекс = 0;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВходМассив;
	
КонецФункции

// Получает масссив вида 1, 2, 3 ....
//
Функция ИндексМассив(НачальноеЧисло, ДлинаМассива, Перемешивать) Экспорт
	
	ИндексМассив = Новый Массив();
	Число = НачальноеЧисло;
	Для А=0 По ДлинаМассива-1 Цикл 
		ИндексМассив.Добавить(Число);
		Число = Число + 1;
	КонецЦикла;
	
	Если Перемешивать Тогда
		ИндексМассив = ПеремешатьМассив(ИндексМассив);
	КонецЕсли;
	
	Возврат ИндексМассив;
	
КонецФункции

// Если в коллекции значений есть свойство, возвращает Истина.
//
Функция ЕстьСвойствоВКоллекции(Коллекция, ИмяСвойства, ИсключитьНеопределенныеЗначения=Ложь) Экспорт
	
	ЕстьСвойство = Ложь;
	
	Если ТипЗнч(Коллекция) = Тип("Структура") Тогда
		ЕстьСвойство = Коллекция.Свойство(ИмяСвойства);
	КонецЕсли;
	
	Если ТипЗнч(Коллекция) = Тип("СтрокаТаблицыЗначений") Тогда		
		ЕстьСвойство = ?(Коллекция.Владелец().Колонки.Найти(ИмяСвойства) = Неопределено, Ложь, Истина);		
	КонецЕсли;	
	
	Если НЕ ЕстьСвойство Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Если ЕстьСвойство И ИсключитьНеопределенныеЗначения Тогда
			Возврат ?(Коллекция[ИмяСвойства] = NULL ИЛИ Коллекция[ИмяСвойства] = Неопределено, Ложь, Истина);
		Иначе
			Возврат ЕстьСвойство;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецФункции

Функция ТаблицаВФиксированныйМассив(ТаблицаЗначений) Экспорт
	
	Колонки = ТаблицаЗначений.Колонки;
	
	МассивЗначений = Новый Массив;
	
	Для каждого Строка Из ТаблицаЗначений Цикл
		
		СтруктураЗначений = Новый Структура;
		
		Для каждого Колонка Из Колонки Цикл		 
		 	СтруктураЗначений.Вставить(Колонка.Имя, Строка[Колонка.Имя]);		 
		КонецЦикла;
		
		МассивЗначений.Добавить(Новый ФиксированнаяСтруктура(СтруктураЗначений));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивЗначений); 
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ПЕРЕЧИСЛЕНИЯМИ

// Возвращает имя перечисления.
//
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления) Экспорт

	Если НЕ ЗначениеЗаполнено(ЗначениеПеречисления) Тогда
		Возврат "";	
	КонецЕсли;
	
	Возврат XMLстрока(ЗначениеПеречисления); 
	
КонецФункции

Функция ЗначениеПеречисленияПоИндексу(ИмяПеречисления, Индекс) Экспорт
	
	Возврат Перечисления[ИмяПеречисления].Получить(Индекс);
	
КонецФункции

Функция ИсключитьЗначенияПеречисленияИзСпискаВыбора(Параметры, ДанныеВыбора, ИмяПеречисления, СтандартнаяОбработка) Экспорт
	
	Если Параметры.Свойство("ИсключитьЗначения") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Перечисление.Ссылка
			|ИЗ
			|	Перечисление."+ИмяПеречисления+" КАК Перечисление
			|
			|УПОРЯДОЧИТЬ ПО
			|	Перечисление.Порядок";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		МассивИсключений = Параметры.ИсключитьЗначения;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если МассивИсключений.Найти(ВыборкаДетальныеЗаписи.Ссылка) = Неопределено Тогда
			
				Элемент = ДанныеВыбора.Добавить();
				Элемент.Значение = ВыборкаДетальныеЗаписи.Ссылка;
				Элемент.Представление = ВыборкаДетальныеЗаписи.Ссылка;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ФАЙЛАМИ

Функция ИзвлечьТекстИзДвоичныхДанных(Знач ДвоичныеДанные, Знач РасширениеФайла="tmp") Экспорт
	
	Если ТипЗнч(ДвоичныеДанные) = Тип("Строка") Тогда
		ПутьКВременномуФайлу = ДвоичныеДанные; 
	Иначе
		ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);
		ДвоичныеДанные.Записать(ПутьКВременномуФайлу);
	КонецЕсли;
	
	Извлечение = Новый ИзвлечениеТекста(ПутьКВременномуФайлу);
	
	ТекстФайла = "";
	
	Попытка
		
		ТекстФайла = Извлечение.ПолучитьТекст();
		
	Исключение
		
		ОписаниеОшибкиИнфо = ОписаниеОшибки();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								 НСтр("ru = 'Во время извлечения текста из файла ""%1"" при записи его в базу данных произошла неизвестная ошибка'"), 
								 ПутьКВременномуФайлу);
		ТекстСообщения = ТекстСообщения + Строка(ОписаниеОшибкиИнфо);
		
		ЗаписьЖурналаРегистрации("Извлечение текста", 
			УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСообщения);

	КонецПопытки;
	
	УдалитьФайлы(ПутьКВременномуФайлу);
	
	Возврат ТекстФайла;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ДОКУМЕНТЫ

Процедура ПровестиДокументы(Документы, РежимЗаписи=Неопределено, ДополнительныеСвойства=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Документы) = Тип("Массив") Тогда
		МассивДокументов = Документы;
	Иначе
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Документы);
	КонецЕсли;
	
	Для каждого Документ Из МассивДокументов Цикл
	
		ДокументОбъект = Документ.ПолучитьОбъект();
		
		Если ДополнительныеСвойства <> Неопределено Тогда
		
			Для каждого Свойство Из ДополнительныеСвойства Цикл
				ДокументОбъект.ДополнительныеСвойства.Вставить(Свойство.Ключ, Свойство.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
		Если РежимЗаписи = Неопределено Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
			
		Попытка 
			ДокументОбъект.Заблокировать();
		Исключение
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСТР("ru = 'Не удалось заблокировать объект %1'"),
				Строка(ДокументОбъект));
		КонецПопытки;
			
		ДокументОбъект.Записать(РежимЗаписи);
		ДокументОбъект.Разблокировать();
	
	КонецЦикла;
	
КонецПроцедуры

// Перепроводит все документы из переданной выборки.
//
Процедура ПерепровестиВыборкуДокументов(ВыборкаДетальныеЗаписи, РежимЗаписи=Неопределено, ДополнительныеСвойства=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПровестиДокументы(ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписи, ДополнительныеСвойства);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СПРАВОЧНИКИ

// Возвращает ссылку на элемент справочника по его идентификатору.
//
Функция ЭлементСправочникаПоИдентификатору(Знач ИмяСправочника, Знач УникальныйИдентификатор) Экспорт
	
	Если ТипЗнч(УникальныйИдентификатор) = Тип("Строка") Тогда
		УникальныйИдентификатор  = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Справочники[ИмяСправочника].ПолучитьСсылку(УникальныйИдентификатор);
	
КонецФункции

// Ищет ссылку на элемент справочника по его наименованию.
//
Функция НайтиЭлементСправочника(ИмяСправочника, ИмяРеквизита, ЗначениеРеквизита, Владелец=Неопределено, ЭтоГруппа=Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	"+ИмяСправочника+".Ссылка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
		|ГДЕ
		|	"+ИмяСправочника+".ПометкаУдаления = ЛОЖЬ
		|	И "+ИмяСправочника+"."+ИмяРеквизита+" = &ЗначениеРеквизита";
		
	Если Владелец <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И "+ИмяСправочника+".Владелец = &Владелец";

		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
	КонецЕсли;
	
	Если ЭтоГруппа <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И "+ИмяСправочника+".ЭтоГруппа = &ЭтоГруппа";

		
		Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоГруппа);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
		
	Иначе
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
КонецФункции

// Помечает на удаление элемент справочника.
//
Процедура УдалитьЭлементСправочника(СсылкаНаЭлемент) Экспорт
 	 
	 Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда 
		 
		 СправочникОбъект = СсылкаНаЭлемент.ПолучитьОбъект();
		 
		 Если СправочникОбъект.ПометкаУдаления Тогда
			 Возврат;
		 КонецЕсли;
		 
		 СправочникОбъект.Заблокировать();
		 СправочникОбъект.УстановитьПометкуУдаления(Истина, Истина);
		 СправочникОбъект.Разблокировать();
		 
	 КонецЕсли;
	  	
КонецПроцедуры

Процедура ИзменитьРеквизитЭлементаСправочника(ЭлементСправочника, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Если ЗначениеЗаполнено(ЭлементСправочника) Тогда
		
		ЭлементСправочникаОбъект = ЭлементСправочника.ПолучитьОбъект();
		
		ЭлементСправочникаОбъект.Заблокировать();
		ЭлементСправочникаОбъект[ИмяРеквизита] = ЗначениеРеквизита;
		ЭлементСправочникаОбъект.Записать();
		ЭлементСправочникаОбъект.Разблокировать();
	
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает структуру,содержащую значения реквизитов
// прочитанные из информационной базы по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИменаРеквизитов - Строка, имена реквизитов перечисленные через запятую,
//               в формате требований к свойствам структуры.
//               Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Структура    - содержит список свойств, как список имен в строке
//                 ИменаРеквизитов, со значениям реквизитов, прочитанных
//                 из информационной базы.
// 
Функция ЗначенияРеквизитовВПривилегированномРежиме(Ссылка, ИменаРеквизитов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	" + ИменаРеквизитов + "
		|ИЗ
		|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Результат = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Функция ПолучитьЗначениеРеквизита возвращает значение
// реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаВПривилегированномРежиме(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовВПривилегированномРежиме(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// КОНФИГУРАЦИЯ
 
// Устанавливает параметр сеанса.
//
Процедура УстановитьПараметрыСеанса(СтруктураПараметров) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Элемент Из СтруктураПараметров Цикл
		ПараметрыСеанса[Элемент.Ключ] = Элемент.Значение;
	КонецЦикла;
	
КонецПроцедуры

// Определяет, является ли конфигурация базовой
//
Функция ЭтоБазоваяВерсияКонфигурации() Экспорт
	Возврат СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
КонецФункции

Функция АдресИнформационнойБазы() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.АдресИнформационнойБазыСУ.Получить();
КонецФункции

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

// Удалить форму: НастройкиВебСервераСУ

Функция ПроверитьСоединениеСБазой() Экспорт
	
	АдресУдаленнойБазы = АдресИнформационнойБазы();
	
	Если НЕ ЗначениеЗаполнено(АдресУдаленнойБазы) Тогда
		Возврат НСтр("ru = 'Адрес информационной базы не задан'");
	КонецЕсли;
	
	// Обновляем служебного пользователя
	
	СоздатьСлужебногоПользователяДляСоединенияСБазой();
	
	// Проверяем HTTP сервисы
	
	ТаблицаСервисов = Новый ТаблицаЗначений;
	ТаблицаСервисов.Колонки.Добавить("Корень");
	ТаблицаСервисов.Колонки.Добавить("Имя");
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	НоваяСтрокаТС = ТаблицаСервисов.Добавить();
	НоваяСтрокаТС.Корень = "cabinet";
	НоваяСтрокаТС.Имя = "Обучение";
	
	//----------------------------------//
	
	НоваяСтрокаТС = ТаблицаСервисов.Добавить();
	НоваяСтрокаТС.Корень = "users";
	НоваяСтрокаТС.Имя = "Пользователи";
	
	НоваяСтрокаТС = ТаблицаСервисов.Добавить();
	НоваяСтрокаТС.Корень = "res";
	НоваяСтрокаТС.Имя = "Электронные ресурсы";
	
	Для каждого СтрокаТС Из ТаблицаСервисов Цикл
		
		// Формируем адрес запроса
		
		АдресСоединенияССервисом = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресУдаленнойБазы);
		АдресСоединенияССервисом = АдресСоединенияССервисом + "hs/"+СтрокаТС.Корень+"/version";
		
		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресСоединенияССервисом);		
		
		// Делаем запрос к сервису
		
		Если Константы.СлужебныйПользовательУказанВПубликацииСУ.Получить() Тогда
			ЛогинИПароль = Неопределено;
		Иначе		
			ЛогинИПароль = ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой();
		КонецЕсли;
		
		ЗащищенноеСоединение = ?(НРег(СтруктураURI.Схема) = "https",  Новый ЗащищенноеСоединениеOpenSSL(), Неопределено); 
			
		HTTPСоединение = Новый HTTPСоединение(
			СтруктураURI.Хост, СтруктураURI.Порт, ЛогинИПароль, ЛогинИПароль,, 60, ЗащищенноеСоединение); 
		
		ЗапросHTTP = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);	
		
		// Обрабатываем ответ сервера
		
		ОтветСервера = HTTPСоединение.Получить(ЗапросHTTP);
		
		Если ОтветСервера.КодСостояния = 200 Тогда
			
			ОтветСервераСтрока = ОтветСервера.ПолучитьТелоКакСтроку();
			Попытка
				ОтветСервераСтруктура = ОбщегоНазначенияСУ.JSONВДанные(ОтветСервераСтрока);
			Исключение
				Возврат НСТр("ru = 'Ошибка: неожиданный ответ базы'");
			КонецПопытки;
			
			ДанныеОтвета = Неопределено;
			ОтветСервераСтруктура.Свойство("data", ДанныеОтвета);
			
			Если ДанныеОтвета = Неопределено Тогда
				Возврат НСТр("ru = 'Ошибка: ошибка формата ответа'");
			КонецЕсли;
			
			ИдентификаторБазыВОтвете = Неопределено;
			ДанныеОтвета.Свойство("База", ИдентификаторБазыВОтвете);
			
			Если ИдентификаторБазыВОтвете = Неопределено Тогда
				Возврат НСТр("ru = 'Ошибка: идентификатор базы не указан в ответе'");
			КонецЕсли;
			
			Если ИдентификаторБазыВОтвете <> СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы() Тогда
				Возврат НСТр("ru = 'Ошибка: указан адрес другой базы'");
			КонецЕсли;
			
		Иначе
			
			Если ОтветСервера.КодСостояния = 404 Тогда			
				Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка: сервис ""%1"" по адресу %2 не найден.
					|Проверьте адрес публикации информационной базы и опубликованы ли все web и http сервисы'"),
					СтрокаТС.Имя, АдресСоединенияССервисом);
			ИначеЕсли ОтветСервера.КодСостояния = 401 Тогда			
				Возврат НСтр("ru = 'Ошибка авторизации. Проверьте правильность указания данных служебного пользователя в файле default.vrd'");
			Иначе			
				Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Возникла ошибка при обращении к публикации информационной базы. Код ошибки -  %1. Для исправления откройте публикацию информационной базы в браузере по указанному адресу. Изучите текст ошибки. Обратитесь к документации технологической платформы «1С:Предприятие» используемой версии, руководство администратора, глава «Настройка веб-серверов для работы с «1С:Предприятием».'"), Строка(ОтветСервера.КодСостояния));			
			КонецЕсли;		
			
		КонецЕсли;		
	
	КонецЦикла;	
	
	// Проверяем web-сервисы
	
	АдресСоединенияССервисом = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресУдаленнойБазы);
	АдресСоединенияССервисом = АдресСоединенияССервисом + "ws/res.1cws?wsdl";
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресСоединенияССервисом);		
	
	// Делаем запрос к сервису
	
	Если Константы.СлужебныйПользовательУказанВПубликацииСУ.Получить() Тогда
		ЛогинИПароль = Неопределено;
	Иначе		
		ЛогинИПароль = ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой();
	КонецЕсли;
	
	ЗащищенноеСоединение = ?(НРег(СтруктураURI.Схема) = "https",  Новый ЗащищенноеСоединениеOpenSSL(), Неопределено); 
		
	HTTPСоединение = Новый HTTPСоединение(
		СтруктураURI.Хост, СтруктураURI.Порт, ЛогинИПароль, ЛогинИПароль,, 60, ЗащищенноеСоединение); 
	
	ЗапросHTTP = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);	
	
	// Обрабатываем ответ сервера
	
	ОтветСервера = HTTPСоединение.Получить(ЗапросHTTP);
	
	Если ОтветСервера.КодСостояния <> 200 Тогда	
			
		Если ОтветСервера.КодСостояния = 404 ИЛИ ОтветСервера.КодСостояния = 500 Тогда			
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка: веб-сервис ""Электронные ресурсы"" по адресу %1 не найден.
				|Проверьте адрес публикации информационной базы и опубликованы ли все web и http сервисы'"),
				АдресСоединенияССервисом);
		ИначеЕсли ОтветСервера.КодСостояния = 401 Тогда			
			Возврат НСтр("ru = 'Ошибка авторизации. Проверьте правильность указания данных служебного пользователя в файле default.vrd'");
		Иначе			
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Код ошибки: %1'"), Строка(ОтветСервера.КодСостояния));			
		КонецЕсли;		
		
	КонецЕсли;			
	
КонецФункции

Функция ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой() Экспорт
	Возврат "sdo";
КонецФункции

Процедура СоздатьСлужебногоПользователяДляСоединенияСБазой() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоличествоПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей().Количество();
	
	Если КоличествоПользователей = 0 Тогда		
		ВызватьИсключение НСтр("ru = 'Нельзя создать служебного пользователя, т.к. в программе отсутствуют другие пользователи'");
	КонецЕсли;	
	
	ЛогинИПароль = ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой();
	
	Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("e17ee297-2acf-4dc9-9d05-09a1d53f8797"));
	
	ОписаниеПользователяИБ = Новый Структура();
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить("Имя", ЛогинИПароль);
	ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
	ОписаниеПользователяИБ.Вставить("АутентификацияОС", Ложь);
	ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", Ложь);
	ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", Ложь);
	ОписаниеПользователяИБ.Вставить("Пароль", ЛогинИПароль);
	ОписаниеПользователяИБ.Вставить("ЗапрещеноИзменятьПароль", Истина);
	ОписаниеПользователяИБ.Вставить("Роли", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.Роли.ВебКабинетСлужебныйПользовательСУ.Имя));
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Пользователь) Тогда
		ПользовательОбъект = Пользователь.ПолучитьОбъект();
	Иначе
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.УстановитьСсылкуНового(Пользователь);
	КонецЕсли;
	
	ПользовательОбъект.Наименование = НСтр("ru = 'Служебный пользователь для соединения с базой'");
	ПользовательОбъект.Служебный = Истина;
	ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);	
	ПользовательОбъект.Записать();
	
КонецПроцедуры

//----------------------------------//

// Записывает в журнал регистрации описание ошибки.
//
// Параметры:
//	СообщениеОбОшибке - Строка - строковое представление ошибки.
//	Данные - Произвольный - данные, к которым относится сообщение об ошибке.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, Данные = Неопределено) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ОбщегоНазначенияСУКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(),
		УровеньЖурналаРегистрации.Ошибка,
		,
		Данные,
		СообщениеОбОшибке);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФОРМАТИРОВАННЫЙ ДОКУМЕНТ, HTML, JSON

// Позволяет получить HTML представление форматированного документа
// для последующего размещения в виде страницы HTML.
//
Функция ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, ИдентификаторОбъекта, КодДанных="", ВключитьДвоичныеДанные=Ложь, ВключитьHTMLДанные=Истина) Экспорт
	
	Перем ТекстHTML;
	Перем Вложения;
	
	Представление = Новый Структура("ПредставлениеHTML, ЕстьВложения, ДвоичныеДанные, ИдентификаторКаталога", "", Ложь, Неопределено, "");
	
	Если ФорматированныйДокумент = Неопределено Тогда
		Возврат Представление;
	КонецЕсли;
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	// Получаем вложения
	//	

	Если Вложения.Количество() > 0 Тогда
		
		Представление.ЕстьВложения = Истина;
		
		Если ВключитьДвоичныеДанные Тогда
			
			ВременныйКаталогДляВложений = ПолучитьИмяВременногоФайла("");
			СоздатьКаталог(ВременныйКаталогДляВложений);
			ВременныйКаталогДляВложений = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ВременныйКаталогДляВложений);			
			
			Для каждого Элемент Из Вложения Цикл
				
				ПолныйПутьКФайлу = ВременныйКаталогДляВложений + Элемент.Ключ + ОбщегоНазначенияСУКлиентСервер.РасширениеКартинки(Элемент.Значение.Формат());
				Элемент.Значение.Записать(ПолныйПутьКФайлу);
			
			КонецЦикла;
			
			ПолноеИмяАрхиваZIP = ПолучитьИмяВременногоФайла(".zip");
			
			ФайлZIP = Новый ЗаписьZipФайла(ПолноеИмяАрхиваZIP);			
			
			ФайлZIP.Добавить(ВременныйКаталогДляВложений + "*.*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			
			ФайлZIP.Записать();
			
			Представление.ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяАрхиваZIP);
			
			УдалитьФайлы(ПолноеИмяАрхиваZIP);
			УдалитьФайлы(ВременныйКаталогДляВложений);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Получаем идентификатор каталога
	//
	
	Постфикс = ОбъектыСУЗ.ПолучитьПостфиксРесурса(КодДанных);
	
	Представление.ИдентификаторКаталога = Строка(ИдентификаторОбъекта) + Постфикс;
	
	// Заменяем пути к картинкам и получаем тело сообщения
	//
	
	Если ВключитьHTMLДанные Тогда
	
		ЧтениеHTML = Новый ЧтениеHTML;
		ЧтениеHTML.УстановитьСтроку(ТекстHTML);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
		
		ОтносительныйПутьККартинкам = Представление.ИдентификаторКаталога + "/";
		
		Для каждого КартинкаHTML Из ДокументHTML.Картинки Цикл
			
			ЭтоURL = ?(Найти(КартинкаHTML.Источник, ":") > 0, Истина, Ложь);
			            
			Картинка = Неопределено;
			
			Если ЗначениеЗаполнено(КартинкаHTML.Источник)
				И НЕ ЭтоURL
				И Вложения.Свойство(КартинкаHTML.Источник, Картинка) Тогда
				
				Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
					Расширение = ОбщегоНазначенияСУКлиентСервер.РасширениеКартинки(Картинка.Формат());
					ИмяФайлаВложения = КартинкаHTML.Источник + Расширение;
				Иначе
					ИмяФайлаВложения = КартинкаHTML.Источник;
				КонецЕсли;
				
				КартинкаHTML.Источник = ОтносительныйПутьККартинкам + ИмяФайлаВложения;
				
			КонецЕсли;
			
		КонецЦикла;

		ИсправитьПроблемныеСсылкиФорматированногоДокумента(ДокументHTML);
		
		ЗаписьHTML = Новый ЗаписьHTML;
		ЗаписьHTML.УстановитьСтроку();

		ЗаписьDOM = Новый ЗаписьDOM;
		ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML); 

		// Выделяем тело форматированного документа и возвращаем
		//
		
		Представление.ПредставлениеHTML = ВыделитьТелоHTMLДокумента(ЗаписьHTML.Закрыть());
		
	КонецЕсли;
		
	Возврат Представление;
	
КонецФункции

// Позволяет получить HTML представление форматированного документа
// для последующего размещения в поле HTML документа без выгрузки на диск.
//
Функция ПредставлениеФорматированныйДокументДляПоляHTML(ФорматированныйДокумент, ИдентификаторФормы) Экспорт
	
	ТекстHTML = "";
	Вложения  = Новый Структура;
	
	Если ФорматированныйДокумент = Неопределено Тогда
		Возврат ТекстHTML;	
	КонецЕсли;
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);

	// Заменяем пути к картинкам и получаем тело сообщения
	
	Если Вложения.Количество() > 0 Тогда
	
		ЧтениеHTML = Новый ЧтениеHTML;
		ЧтениеHTML.УстановитьСтроку(ТекстHTML);
		
		ПостроительDOM = Новый ПостроительDOM;
		ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
		
		Для каждого КартинкаHTML Из ДокументHTML.Картинки Цикл
			
			Картинка = Неопределено;
			
			Вложения.Свойство(КартинкаHTML.Источник, Картинка);
			
			Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
				КартинкаHTML.Источник = ПоместитьВоВременноеХранилище(Картинка, ИдентификаторФормы);
			КонецЕсли;
			
		КонецЦикла;

		ИсправитьПроблемныеСсылкиФорматированногоДокумента(ДокументHTML);
		
		ЗаписьHTML = Новый ЗаписьHTML;
		ЗаписьHTML.УстановитьСтроку();

		ЗаписьDOM = Новый ЗаписьDOM;
		ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML); 

		ТекстHTML = ЗаписьHTML.Закрыть();
		
	КонецЕсли;
		
	// Выделяем тело форматированного документа и возвращаем
	
	Возврат ВыделитьТелоHTMLДокумента(ТекстHTML);	
		
КонецФункции

// Возвращает содержимое тега <body>.
//
Функция ВыделитьТелоHTMLДокумента(Знач ТекстHTMLДокумента) Экспорт
	
    ТекстНРег = НРег(ТекстHTMLДокумента);
	
    НачалоТегаТела = Найти(ТекстНРег, "<body>");
	Если НачалоТегаТела = 0 Тогда
		НачалоТегаТела = Найти(ТекстНРег, "<body ");
	КонецЕсли;
	Если НачалоТегаТела = 0 Тогда
		Возврат ТекстHTMLДокумента;
	КонецЕсли;
	ТекстHTMLДокумента = Сред(ТекстHTMLДокумента, НачалоТегаТела+5, СтрДлина(ТекстНРег));
	КонецТегаТела = Найти(ТекстHTMLДокумента, ">");
	ТекстHTMLДокумента = Сред(ТекстHTMLДокумента, КонецТегаТела+1, СтрДлина(ТекстHTMLДокумента));
	
 	ТекстНРег = НРег(ТекстHTMLДокумента);
	
    НачалоТегаТела = Найти(ТекстНРег, "</body>");
	Если НачалоТегаТела = 0 Тогда
		НачалоТегаТела = Найти(ТекстНРег, "<body ");
	КонецЕсли;
	Если НачалоТегаТела = 0 Тогда
		Возврат ТекстHTMLДокумента;
	КонецЕсли;
	
	ТекстHTMLДокумента = Сред(ТекстHTMLДокумента, 1, НачалоТегаТела-1);
	
	Возврат ТекстHTMLДокумента;
	
КонецФункции

Функция ВыделитьТекстHTMLДокумента(Знач ТекстHTMLДокумента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(ТекстHTMLДокумента)) Тогда
		Возврат "";
	КонецЕсли;
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(ТекстHTMLДокумента);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	Если ДокументHTML.Тело = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат ДокументHTML.Тело.ТекстовоеСодержимое;
	КонецЕсли;
	
КонецФункции

Функция JSONВДанные(Знач СтрокаJSON, Знач ДлинаСтроки = Неопределено, НомерСимвола = 1, ПоместитьВСоответствие = Ложь) Экспорт
	
	Если ДлинаСтроки = Неопределено Тогда
		ДлинаСтроки = СтрДлина(СтрокаJSON);
	КонецЕсли;
	
	Если НомерСимвола > ДлинаСтроки Тогда
		Возврат "";
	КонецЕсли;
	
	Символ = Сред(СтрокаJSON, НомерСимвола, 1);
	
	Если Символ = """" Тогда // Строка в кавычках
		
		Результат = "";
		
		НомерСимволаНачалаСтроки = НомерСимвола; // Номер символа, с которого начинается поиск значения
		НомерСимволаНачалаПоиска = НомерСимвола; // Номер символа, с которого ищется значение в цикле
		КонецСтрокиНайден = Ложь;
		ДлинаЗначения = 0;
		
		Пока НомерСимволаНачалаПоиска < ДлинаСтроки И НЕ КонецСтрокиНайден Цикл
		
			ПодстрокаПоиска = Сред(СтрокаJSON, НомерСимволаНачалаПоиска + 1); // Подстрока для поиска закрывающей кавычки
			
			НомерСимволаКавычки = Найти(ПодстрокаПоиска, Символ); // Номер символа закрывающей кавычки
			
			Если НомерСимволаКавычки = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если Сред(ПодстрокаПоиска, НомерСимволаКавычки - 1, 1) = "\" Тогда
				НомерСимволаНачалаПоиска = НомерСимволаНачалаПоиска + НомерСимволаКавычки;
			Иначе
				КонецСтрокиНайден = Истина;
			КонецЕсли;
			
			ДлинаЗначения = ДлинаЗначения + НомерСимволаКавычки;
			
		КонецЦикла;
		
		Если НЕ КонецСтрокиНайден Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Окончание строки не найдено (%1)'"), Строка(НомерСимвола));
		КонецЕсли;
		
		Результат = Сред(СтрокаJSON, НомерСимволаНачалаСтроки + 1, ДлинаЗначения - 1);
		
		Результат = ОбщегоНазначенияСУКлиентСервер.СтрокаИзJSСтроки(Результат);
		
		НомерСимвола = НомерСимвола + ДлинаЗначения + 1; 
		
	ИначеЕсли Символ = "[" Тогда // Массив
		
		Результат = Новый Массив;
		
		НомерСимвола = НомерСимвола + 1;
		
		Символ = Сред(СтрокаJSON, НомерСимвола, 1);

		Если Символ = "]" Тогда
			
			НомерСимвола = НомерСимвола + 1; // Пустой массив
			
		Иначе
		
			Пока НомерСимвола <= ДлинаСтроки Цикл
				
				Результат.Добавить(JSONВДанные(СтрокаJSON, ДлинаСтроки, НомерСимвола, ПоместитьВСоответствие)); // Рекурсия
				
				Символ = Сред(СтрокаJSON, НомерСимвола, 1);
				
				Если Символ = "]" Тогда																					
					
					НомерСимвола = НомерСимвола + 1; 
					
					Прервать;
					
				ИначеЕсли Символ = "," Тогда																				
					
					НомерСимвола = НомерСимвола + 1;
						
				Иначе     
					
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Недопустимый символ (%1)'"), Строка(НомерСимвола));
				
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
			
	ИначеЕсли Символ = "{" Тогда // Объект
		
		Если ПоместитьВСоответствие Тогда
			Результат = Новый Соответствие;
		Иначе
			Результат = Новый Структура;
		КонецЕсли;
		
		НомерСимвола = НомерСимвола + 1;

		Символ = Сред(СтрокаJSON, НомерСимвола, 1);
		
		Если Символ = "}" Тогда	 // Пустой объект.													
			
			НомерСимвола = НомерСимвола + 1;

		Иначе
			
			НомерЭлемента = 1;
			
			Пока НомерСимвола <= ДлинаСтроки Цикл
				
				КлючЭлемента = JSONВДанные(СтрокаJSON, ДлинаСтроки, НомерСимвола, ПоместитьВСоответствие); // Рекурсия
				
				Символ = Сред(СтрокаJSON, НомерСимвола, 1);
				
				Если Символ = ":" Тогда
					
					НомерСимвола = НомерСимвола + 1;
					
				Иначе
					
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Недопустимый символ разделения свойств объекта (%1)'"), Строка(НомерСимвола));
					
				КонецЕсли;
				
				ЗначениеЭлемента = JSONВДанные(СтрокаJSON, ДлинаСтроки, НомерСимвола, ПоместитьВСоответствие); // Рекурсия
				
				Результат.Вставить(КлючЭлемента, ЗначениеЭлемента);
				
				Символ = Сред(СтрокаJSON, НомерСимвола, 1);
				
				Если Символ = "}" Тогда
					
					НомерСимвола = НомерСимвола + 1;
					
					Прервать;
					
				ИначеЕсли  Символ = "," Тогда
					
					НомерСимвола = НомерСимвола + 1;
					
				Иначе
					
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Недопустимый символ разделения объектов (%1)'"), Строка(НомерСимвола));
					
				КонецЕсли;
				
				НомерЭлемента = НомерЭлемента + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе // Примитивные типы
		
		Если Сред(СтрокаJSON, НомерСимвола, 4) = "null" Тогда
			
			НомерСимвола = НомерСимвола + 4;
			
			Результат = NULL;
			
		ИначеЕсли Сред(СтрокаJSON, НомерСимвола, 4) = "true" Тогда
			
			НомерСимвола = НомерСимвола + 4;
			
			Результат = Истина;
			
		ИначеЕсли Сред(СтрокаJSON, НомерСимвола, 5) = "false" Тогда
			
			НомерСимвола = НомерСимвола + 5;
			
			Результат = Ложь;
			
		ИначеЕсли Сред(СтрокаJSON, НомерСимвола, 9) = "undefined" Тогда
			
			НомерСимвола = НомерСимвола + 9;
			
			Результат = Неопределено;
			
		Иначе
			
			НачалоЧисла = НомерСимвола;
			
			Пока Найти("-+0123456789.", Символ) > 0 И НомерСимвола <= ДлинаСтроки Цикл
				НомерСимвола = НомерСимвола + 1;
				Символ = Сред(СтрокаJSON, НомерСимвола, 1);
			КонецЦикла;
			
			Попытка
				Результат = Число(Сред(СтрокаJSON, НачалоЧисла, НомерСимвола - НачалоЧисла));
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка преобразования в число (%1)'"), Сред(СтрокаJSON, НачалоЧисла, НомерСимвола - НачалоЧисла));
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеВJSON(Знач Данные) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Массив") ИЛИ ТипЗнч(Данные) = Тип("ФиксированныйМассив") Тогда
		
		СтрокаJSON = "[";
		
		Если Данные.Количество() > 0 Тогда
		
			Для каждого ЭлементМассива Из Данные Цикл
				СтрокаJSON = СтрокаJSON + ДанныеВJSON(ЭлементМассива) + ",";	
			КонецЦикла;
			
			СтрокаJSON = Сред(СтрокаJSON, 1, СтрДлина(СтрокаJSON) - 1); // Убираем последнюю запятую
			
		КонецЕсли;
			
		СтрокаJSON = СтрокаJSON + "]";
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура") ИЛИ ТипЗнч(Данные) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтрокаJSON = "{";
		
		Если Данные.Количество() > 0 Тогда
		
			Для каждого ЭлементСтруктуры Из Данные Цикл
				СтрокаJSON = СтрокаJSON + """" + ЭлементСтруктуры.Ключ + """" + ":" + ДанныеВJSON(ЭлементСтруктуры.Значение) + ",";	
			КонецЦикла;
			
			СтрокаJSON = Сред(СтрокаJSON, 1, СтрДлина(СтрокаJSON) - 1); // Убираем последнюю запятую
			
		КонецЕсли;
			
		СтрокаJSON = СтрокаJSON + "}";
		
	ИначеЕсли ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
		
		СтрокаJSON = "[";
		
		Если Данные.Количество() > 0 Тогда
			
			Для каждого СтрокаТаблицы Из Данные Цикл
				
				СтрокаJSON = СтрокаJSON + "{";
				
				Для каждого КолонкаТаблицы Из Данные.Колонки Цикл
					СтрокаJSON = СтрокаJSON + """" + КолонкаТаблицы.Имя + """" + ":" + ДанныеВJSON(СтрокаТаблицы[КолонкаТаблицы.Имя]) + ",";
				КонецЦикла;
				
				СтрокаJSON = Сред(СтрокаJSON, 1, СтрДлина(СтрокаJSON) - 1); // Убираем последнюю запятую
				
				СтрокаJSON = СтрокаJSON + "},";
				
			КонецЦикла;
			
			СтрокаJSON = Сред(СтрокаJSON, 1, СтрДлина(СтрокаJSON) - 1); // Убираем последнюю запятую
			
			
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + "]";
		
	ИначеЕсли ТипЗнч(Данные) = Тип("ДеревоЗначений") ИЛИ ТипЗнч(Данные) = Тип("КоллекцияСтрокДереваЗначений") Тогда
		
		СтрокаJSON = "[";
		
		Если ТипЗнч(Данные) = Тип("ДеревоЗначений") Тогда
			СтрокиДерева = Данные.Строки;
		Иначе
			СтрокиДерева = Данные;
		КонецЕсли;
		
		Если СтрокиДерева.Количество() > 0 Тогда
			
			Для каждого СтрокаДерева Из СтрокиДерева Цикл
				
				СтрокаJSON = СтрокаJSON + "{";
				
				ВладелецСтроки = СтрокаДерева.Владелец();
				
				Для каждого КолонкаДерева Из ВладелецСтроки.Колонки Цикл
					СтрокаJSON = СтрокаJSON + """" + КолонкаДерева.Имя + """" + ":" + ДанныеВJSON(СтрокаДерева[КолонкаДерева.Имя]) + ",";
				КонецЦикла;
				
				СтрокаJSON = СтрокаJSON + """ПодчиненныеЭлементы"":" + ДанныеВJSON(СтрокаДерева.Строки);
				
				СтрокаJSON = СтрокаJSON + "},";
				
			КонецЦикла;
			
			СтрокаJSON = Сред(СтрокаJSON, 1, СтрДлина(СтрокаJSON) - 1); // Убираем последнюю запятую
			
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + "]";
		
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Число") Тогда
		
		СтрокаJSON = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Данные);	
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Булево") Тогда
		
		СтрокаJSON = ?(Данные, "true", "false");
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Неопределено") Тогда
		
		СтрокаJSON = "null";
		
	ИначеЕсли ТипЗнч(Данные) = Тип("NULL") Тогда
		
		СтрокаJSON = "null";		
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Дата") Тогда
		
		СтрокаJSON = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(Данные));
		
	ИначеЕсли ТипЗнч(Данные) = Тип("ХранилищеЗначения") Тогда
		
		СтрокаJSON = Данные.Получить();
		
	ИначеЕсли ТипЗнч(Данные) <> Тип("Строка") И ОбщегоНазначения.ЗначениеСсылочногоТипа(Данные) Тогда
		
		ВидСсылки = ОбщегоНазначения.ВидОбъектаПоСсылке(Данные);
		
		Если ВидСсылки = "Перечисление" Тогда
			СтрокаJSON = """" + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Данные) + """";
		Иначе
			СтрокаJSON = """" + Строка(Данные.УникальныйИдентификатор()) + """";
		КонецЕсли;
		
	Иначе
		
		СтрокаJSON = """" + ОбщегоНазначенияСУКлиентСервер.JSСтрока(Данные, Ложь) + """";
		
	КонецЕсли;
	
	Возврат СтрокаJSON;
	
КонецФункции

Процедура СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, Источник) Экспорт
	
	ЭлементСкриптHTML =  ДокументHTML.СоздатьЭлемент("script");
	ЭлементСкриптHTML.Источник = Источник;
	ЭлементСкриптHTML.Тип = "text/javascript";
	
	ЭлементHEAD.ДобавитьДочерний(ЭлементСкриптHTML);
	
КонецПроцедуры

Процедура СоздатьЭлементСтилейВHTMLДокументе(ЭлементHEAD, ДокументHTML, Источник) Экспорт
	
	ЭлементСкриптHTML =  ДокументHTML.СоздатьЭлемент("link");
	ЭлементСкриптHTML.Гиперссылка = Источник;
	ЭлементСкриптHTML.Тип = "text/css";
	
	НовыйАтрибут = ДокументHTML.СоздатьАтрибут("rel");
	НовыйАтрибут.Значение = "stylesheet";
	ЭлементСкриптHTML.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);

	ЭлементHEAD.ДобавитьДочерний(ЭлементСкриптHTML);
	
КонецПроцедуры

Функция ГиперссылкиФорматированногоДокумента(ФорматированныйДокумент) Экспорт	
	
	МассивГиперссылок = Новый Массив;
	
	Если ТипЗнч(ФорматированныйДокумент) <> Тип("ФорматированныйДокумент") Тогда
		Возврат МассивГиперссылок;
	КонецЕсли; 
	
	ТекстHTML = "";
	Вложения = Неопределено;
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);		
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(ТекстHTML);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
			
	Гиперссылки = ДокументHTML.ПолучитьЭлементыПоИмени("a");
	
	Для каждого ЭлементВебСсылки Из Гиперссылки Цикл
		МассивГиперссылок.Добавить(ЭлементВебСсылки.Гиперссылка);
	КонецЦикла;

	Возврат МассивГиперссылок;
	
КонецФункции

Процедура ИсправитьПроблемныеСсылкиФорматированногоДокумента(ДокументHTML) 
	
	Гиперссылки = ДокументHTML.ПолучитьЭлементыПоИмени("a");

	Для каждого ЭлементВебСсылки Из Гиперссылки Цикл		
		ОбщегоНазначенияСУКлиентСервер.ИсправитьПроблемнуюСсылкуФорматированногоДокумента(ЭлементВебСсылки.Гиперссылка);		
	КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Запросы

Процедура ДобавитьОтборКЗапросу(Запрос, ТекстОтбора) Экспорт
	
	Если ТипЗнч(Запрос) = Тип("СхемаЗапроса") Тогда
		
		Конструктор = Запрос;
		
		Конструктор.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(ТекстОтбора);
		
	Иначе
		
		Конструктор = Новый СхемаЗапроса;
		Конструктор.УстановитьТекстЗапроса(Запрос.Текст);
		
		Конструктор.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(ТекстОтбора);
		
		Запрос.Текст = Конструктор.ПолучитьТекстЗапроса();	
		
	КонецЕсли;
	
КонецПроцедуры

Функция КолонкиЗапроса(Запрос) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	Колонки = Новый Массив;
	
	Для каждого Колонка Из СхемаЗапроса.ПакетЗапросов[0].Колонки Цикл
		Колонки.Добавить(Колонка.Псевдоним);
	КонецЦикла;
	
	Возврат Колонки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОЛЬЗОВАТЕЛИ

Процедура УстановитьПараметрыЗаписиПользователяСУПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",  Источник.ЭтоНовый());
	
КонецПроцедуры

Функция ПользовательИнформационнойБазы(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
		
	Если ПользовательИБ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПользовательИБ;	
	
КонецФункции

Функция НайтиВсехПользователей(ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	&ОтборПоРеквизиту
		|	И Пользователи.ПометкаУдаления = ЛОЖЬ
		|	И Пользователи.Недействителен = ЛОЖЬ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоРеквизиту", "Пользователи."+ИмяРеквизита+" = &"+ИмяРеквизита+"");
	Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеРеквизита);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РЕГЛАМЕНТНЫЕ ЗАДАНИЯ

Функция ВыполнитьРегламентноеЗаданиеВручную(ИмяЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторЗадания = ОбщегоНазначенияСУПовтИсп.ИдентификаторРегламентногоЗадания(ИмяЗадания);
	
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат РегламентныеЗаданияСлужебный.ВыполнитьРегламентноеЗаданиеВручную(ИдентификаторЗадания);
	
КонецФункции
